# Statistics

In [1]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\KARRI KUJITHA\OneDrive\Desktop\kooji.csv")
df

    Name  Age      GROUP
0   NIHA   23       bcom
1  surya   24        bca
2   raju   35         ds
3   ravi   24         cs
4   kavs   25         ds
5    sri   26         cs
6    sai   27  fisheries
7  meena   32         ai
8   sita   12         ai

In [2]:
df["Age"].max()

35

In [3]:
df["Age"].min()

12

In [4]:
df["Age"].mean()

np.float64(25.333333333333332)

In [5]:
df["Age"].describe()

count     9.000000
mean     25.333333
std       6.403124
min      12.000000
25%      24.000000
50%      25.000000
75%      27.000000
max      35.000000
Name: Age, dtype: float64

In [6]:
import pandas as pd
df[df.Age==df.Age.max()]

   Name  Age GROUP
2  raju   35    ds

In [7]:
df.count()

Name     9
Age      9
GROUP    9
dtype: int64

In [9]:
df['GROUP'].nunique()

6

In [10]:
df['GROUP'].unique()

array(['bcom', 'bca', 'ds', 'cs', 'fisheries', 'ai'], dtype=object)

In [11]:
df['GROUP'].value_counts()

GROUP
ds           2
cs           2
ai           2
bcom         1
bca          1
fisheries    1
Name: count, dtype: int64

# String Cleaning

In [12]:
import pandas as pd
df= pd.read_csv(r"C:\Users\KARRI KUJITHA\OneDrive\Desktop\kooji.csv")
df

    Name  Age      GROUP
0   NIHA   23       bcom
1  surya   24        bca
2   raju   35         ds
3   ravi   24         cs
4   kavs   25         ds
5    sri   26         cs
6    sai   27  fisheries
7  meena   32         ai
8   sita   12         ai

In [13]:
df['GROUP']=df['GROUP'].str.upper()
df

    Name  Age      GROUP
0   NIHA   23       BCOM
1  surya   24        BCA
2   raju   35         DS
3   ravi   24         CS
4   kavs   25         DS
5    sri   26         CS
6    sai   27  FISHERIES
7  meena   32         AI
8   sita   12         AI

In [14]:
df['GROUP']=df['GROUP'].str.lower()
df

    Name  Age      GROUP
0   NIHA   23       bcom
1  surya   24        bca
2   raju   35         ds
3   ravi   24         cs
4   kavs   25         ds
5    sri   26         cs
6    sai   27  fisheries
7  meena   32         ai
8   sita   12         ai

In [15]:
df['Name'].str.lower()

0     niha
1    surya
2     raju
3     ravi
4     kavs
5      sri
6      sai
7    meena
8     sita
Name: Name, dtype: object

In [17]:
df['GROUP']=df['GROUP'].str.replace("fisheries","ai")
df

    Name  Age GROUP
0   NIHA   23  bcom
1  surya   24   bca
2   raju   35    ds
3   ravi   24    cs
4   kavs   25    ds
5    sri   26    cs
6    sai   27    ai
7  meena   32    ai
8   sita   12    ai

# Concatenate DataFrames

In [18]:
india=pd.DataFrame({
    "city": ["Mumbai","Agra","Banglore"],
    "temp": [34,23,45]
})
india

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45

In [19]:
us=pd.DataFrame({
    "city": ["Chicago", "Newyork"," Ireland"],
    "temp": [45,23,67]
})
us

       city  temp
0   Chicago    45
1   Newyork    23
2   Ireland    67

In [20]:
df=pd.concat([india,us])
df

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45
0   Chicago    45
1   Newyork    23
2   Ireland    67

In [21]:
df=pd.concat([india,us],ignore_index=True)
df

       city  temp
0    Mumbai    34
1      Agra    23
2  Banglore    45
3   Chicago    45
4   Newyork    23
5   Ireland    67

In [22]:
df= pd.concat([india,us],axis=1)
df

       city  temp      city  temp
0    Mumbai    34   Chicago    45
1      Agra    23   Newyork    23
2  Banglore    45   Ireland    67

# Merge dataframes

In [23]:
temp=pd.DataFrame({
    "city":["hyd","vzg","N"],
    "tempt":[34,45,67]
})
temp

  city  tempt
0  hyd     34
1  vzg     45
2    N     67

In [24]:
t=pd.DataFrame({
    "city":["hyd","vzg","vijy"],
    "rainfall":[36,55,77]
})
t

   city  rainfall
0   hyd        36
1   vzg        55
2  vijy        77

In [25]:
df=pd.merge(temp,t,on="city")
df

  city  tempt  rainfall
0  hyd     34        36
1  vzg     45        55

In [26]:
df=pd.merge(temp,t,on="city",how="outer")
df

   city  tempt  rainfall
0     N   67.0       NaN
1   hyd   34.0      36.0
2  vijy    NaN      77.0
3   vzg   45.0      55.0

In [27]:
df.isnull()

    city  tempt  rainfall
0  False  False      True
1  False  False     False
2  False   True     False
3  False  False     False

In [28]:
df.isnull().sum()

city        0
tempt       1
rainfall    1
dtype: int64

In [29]:
df["rainfall"]=df["rainfall"].fillna(df.rainfall.min())
df

   city  tempt  rainfall
0     N   67.0      36.0
1   hyd   34.0      36.0
2  vijy    NaN      77.0
3   vzg   45.0      55.0

In [30]:
df["tempt"]=df["tempt"].fillna(df.tempt.max())
df

   city  tempt  rainfall
0     N   67.0      36.0
1   hyd   34.0      36.0
2  vijy   67.0      77.0
3   vzg   45.0      55.0